[{"data":1,"prerenderedAt":80},["ShallowReactive",2],{"$fA8QbdbwX_hP5kQIKCQAHF1ChwkK1cAi8e0ZZYO1CJz8":3,"$fijJYelRhksU_TtQkdid6F3FVcQERtUY0YN1r4am7mR4":28,"$fGRSlqP1TW549qGq3-XEmcqXPcp_tmHwqmumgYZmPh84":78},[4,8,12,16,20,24],{"id":5,"title":6,"title_en":7},1,"Статьи","Articles",{"id":9,"title":10,"title_en":11},2,"Видео","Videos",{"id":13,"title":14,"title_en":15},3,"Музыка","Music",{"id":17,"title":18,"title_en":19},4,"Рецепты","Recipes",{"id":21,"title":22,"title_en":23},5,"Путешествия","Trips",{"id":25,"title":26,"title_en":27},6,"Подкаст","Podcast",{"post":29,"posts":45,"ok":36},{"id":30,"title":31,"title_en":32,"text":33,"preview":34,"img":35,"approved":36,"created_at":37,"updated_at":38,"smile":39,"sad":39,"author_id":5,"rubric_id":5,"author":40,"rubric":44},17,"Свойство margin","svoystvo_margin","\u003Cp>Свойство \u003Ccode>margin\u003C/code>Свойство \u003Ccode>margin\u003C/code> со значением \u003Ccode>auto\u003C/code> позволяет очень гибко управлять выравниванием флекс-элементов. Например, если необходимо, чтобы логотип и заголовок были в левой части контейнера, а кнопка меню прижата к правой части, то достаточно задать кнопке меню значение \u003Ccode>margin-left: auto\u003C/code>. В этом случае отступ займёт всё свободное пространство флекс-контейнера и элемент с кнопкой меню окажется прижат к правой части. Отличие от \u003Ccode>justify-content: space-between\u003C/code> здесь в том, что нет необходимости в дополнительной обёртке для логотипа и заголовка. Также можно задать нескольким элементам свойство \u003Ccode>margin-*: auto\u003C/code>, в этом случае всё свободное пространство контейнера разделится на равные части между отступами элементов, у которых задано это свойство. Данный приём расширяет ту функциональность, которую нам даёт свойство \u003Ccode>justify-content\u003C/code>, мы можем задавать отступы только между необходимыми элементами, а не всеми сразу.\u003C/p>\u003Cimg src=\"/img/17411111309615312294218217155704.webp\" alt=\"\">","Свойство \u003Ccode>margin\u003C/code>Свойство \u003Ccode>margin\u003C/code> со значением \u003Ccode>auto\u003C/code> позволяет очень гибко управлять выравниванием флекс-элементов. Например, если необходимо, чтобы логотип и заголовок были в левой части контейнера, а кнопка меню прижата к правой части, то достаточно задать кнопке меню значение \u003Ccode>margin-left: auto\u003C/code>. В этом случае отступ займёт всё свободное пространство флекс-контейнера и элемент с кнопкой меню окажется прижат к правой части. Отличие от \u003Ccode>justify-content: space-between\u003C/code> здесь в том, что нет необходимости в дополнительной обёртке для логотипа и заголовка. Также можно задать нескольким элементам свойство \u003Ccode>margin-*: auto\u003C/code>, в этом случае всё свободное пространство контейнера разделится на равные части между отступами элементов, у которых задано это свойство. Данный приём расширяет ту функциональность, которую нам даёт свойство \u003Ccode>justify-content\u003C/code>, мы можем задавать отступы только между необходимыми элементами, а не всеми сразу.","img/17411111309615312294218217155704.webp",true,"2025-03-04T17:58:54.432Z","2025-05-29T16:18:02.015Z",0,{"name":41,"pseudo":42,"id":5,"email":43},"User1_Moderator1111",null,"test@mail.ru",{"id":5,"title":6,"title_en":7},[46,57,68],{"id":47,"title":48,"title_en":49,"text":50,"preview":51,"img":52,"approved":36,"created_at":53,"updated_at":38,"smile":39,"sad":39,"author_id":17,"rubric_id":5,"author":54,"rubric":56},34,"Как выбрать правильную ширину сайта","kak_vybrat_pravilnuyu_shirinu_sayta","\u003Cp>Как выбрать правильную ширину сайта. \u003C/p>\u003Cbr>\u003Cbr>\u003Cp>В статье мы рассмотрим, как правильно определить оптимальную ширину сайта для десктопного монитора и мобильных устройств, где можно узнать актуальную статистику популярных разрешений экранов, как проверить отображение своего сайта на разных разрешениях и выявить возможные проблемы. \u003C/p>\u003Cbr>\u003Cbr>\u003Cp>При разработке дизайна для адаптивной вёрстки нужно учесть размеры устройств, на которых чаще всего будет просматриваться сайт. В зависимости от вашей тематики, это могут быть: смартфоны, планшеты, ноутбуки, десктопы или даже габаритные телевизоры с диагональю до 98 дюймов. \u003C/p>\u003Cbr>\u003Cp>И если для пользователя никаких проблем нет, то у разработчика уже возникают определенные сложности, ведь на каждом из экранов сайт должен быть красивым, удобным и функциональным. Поэтому, разрабатывая макет, мы хотим, чтобы пространство использовалось с умом и при этом: При просмотре сайта на широкоформатных экранах не было огромного пустого пространства по бокам, изображения сохраняли высокое качество, а текст легко читался. Сайт не терял удобство использования на небольшом экране, не появлялась полоса горизонтальной прокрутки или скрытые элементы. Но для начала разберёмся, на какую всё-таки ширину html-страницы ориентироваться. Какие бывают форматы размеров сайта для вёрстки У каждого устройства есть несколько характеристик, описывающих его размер: Физический размер экрана — это его диагональ в дюймах (например, 24 дюйма). У устройств с одинаковым размером экрана могут быть разные разрешения. Разрешение — это соотношение экранной ширины и высоты в пикселях (например, 1920 x 1080 пикселей). Размер окна браузера — это ширина и высота области просмотра в пикселях (например, 1896 x 1080 — с учётом полосы прокрутки в 24 пикселя). Другими словами, это разрешение за вычетом рамок, полос прокрутки и других элементов, уменьшающих видимую область сайта. Но размер окна браузера пользователь может сильно менять, поэтому дизайнеры обычно задают контентную область и боковые отступы. \u003C/p>\u003Cbr>\u003Cimg src=\"/img/1747152532094Razmeryoblastejsajtadlyavyorstki.webp\" alt=\"\">\u003Cbr>\u003Cp>Физический размер устройства могут учитывать при дизайне кликабельных элементов, но в основном, размер сайта выбирают под разрешение, а ширину и высоту его контентной области (контейнера) определяют с учётом браузерных отступов. Также нужно помнить об ориентации экранов — у ноутбуков, десктопов и телевизоров она альбомная (ширина больше высоты), а у смартфонов и планшетов обычно портретная (высота больше), но может переворачиваться. Какие есть варианты создания страницы под разные мониторы и разрешения (типы верстки) Фиксированная верстка Проще говоря, мы жестко задаем статические параметры сайта, и его ширина не меняется, независимо от того, какое разрешение у пользователя. Это самый плохой вариант, использовать его вообще не рекомендуется, это явно вчерашний день.\u003C/p>\u003Cbr>\u003Cp> «Источник: https://siteclinic.ru/blog/usability/kak-vybrat-shirinu-sajta/»\u003C/p>","Как выбрать правильную ширину сайта. ","img/1747152532094Razmeryoblastejsajtadlyavyorstki.webp","2025-05-13T16:09:27.340Z",{"name":55,"pseudo":42,"id":17},"ewrwer",{"id":5,"title":6,"title_en":7},{"id":58,"title":59,"title_en":60,"text":61,"preview":62,"img":63,"approved":36,"created_at":64,"updated_at":38,"smile":39,"sad":39,"author_id":13,"rubric_id":5,"author":65,"rubric":67},33,"Пицца Маргарита","picca_margarita","\u003Cimg src=\"/img/1746547178040pizzaM.webp\" alt=\"\">\u003Cp>\u003Cstrong>Ингредиенты:\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Помидоры\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>2шт.\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Базилик\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>по вкусу\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Оливковое масло\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>3ст. л.\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Соль, перец по вкусу\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Мука\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>250г\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Дрожжи\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>10г\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Сахар\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>1/4ч. л.\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Соль\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>1/4ч. л.\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Оливковое масло для смазывания формы\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>по вкусу\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Сыр Моцарелла TM La Paulina\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>150г\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>Сыр Чеддер TM La Paulina (200г)\u003C/strong>\u003C/p>\u003Cp>\u003Cstrong>50г\u003C/strong>\u003C/p>\u003Cp>\u003Cbr>\u003C/p>\u003Ch3>\u003Cstrong>Приготовление:\u003C/strong>\u003C/h3>\u003Cp>\u003Cstrong>Пицца Маргарита — традиционная итальянская пицца, пожалуй, самая популярная в мире, даже меню любой пиццерии начинается, как правило, именно с неё. Состав этой пиццы необычайно прост, её основные ингредиенты: сыр моцарелла, спелые помидоры и листья свежего базилика, которые придают ей неповторимый вкус и аромат.\u003Cbr>\u003Cbr>1. Смешать дрожжи, сахар и 2 ст. л. теплой воды.\u003Cbr>\u003Cbr>2. Добавить 2 ст. л. муки, хорошо перемешать, накрыть полотенцем и поставить в теплое место на 30 минут.\u003Cbr>\u003Cbr>3. Оставшуюся муку высыпать на рабочий стол, в середине сделать углубление. В углубление поместить опару, посолить, добавить примерно 125 мл теплой воды. Должно получиться мягкое тесто, но оно не должно прилипать к рукам.\u003Cbr>\u003Cbr>4. Месить тесто, пока оно не станет гладким и эластичным (примерно 10-15 мин). Тесто накрыть полотенцем и поставить в теплое место на 1 час. Тесто должно увеличиться в объеме примерно вдвое.\u003Cbr>\u003Cbr>5. Нарезать кружочками помидоры.\u003Cbr>\u003Cbr>6. Сыр натереть на терке.\u003Cbr>\u003Cbr>7. Духовку нагреть до 230°С. Взять круглую форму для выпечки пиццы диаметром около 28 см (если нет формы, можно взять обычный противень), смазать оливковым маслом и присыпать мукой.\u003Cbr>\u003Cbr>8. Тесто еще раз вымесить, тонко раскатать примерно по размерам формы и переложить в форму, сделать небольшие бортики по краям. Тесто проколоть в нескольких местах вилкой.\u003Cbr>\u003Cbr>9. Равномерно выложить на тесто сыр, затем помидоры, посолить, поперчить, полить оливковым маслом и выпекать 15-20 мин.\u003C/strong>\u003C/p>","Ингредиенты:","img/1746547178040pizzaM.webp","2025-05-06T16:01:09.132Z",{"name":66,"pseudo":42,"id":13},"User5",{"id":5,"title":6,"title_en":7},{"id":69,"title":70,"title_en":71,"text":72,"preview":73,"img":74,"approved":36,"created_at":75,"updated_at":38,"smile":39,"sad":39,"author_id":5,"rubric_id":5,"author":76,"rubric":77},32,"Космос насквозь пронизан энергией, и Космос насквозь пронизан информацией.","kosmos_naskvoz_pronizan_energiey_i_kosmos_naskvoz_pronizan_informaciey_","\u003Cimg src=\"/img/1743029238018art1.webp\" alt=\"\">\u003Cp>\u003Cstrong>Космос насквозь пронизан энергией, и Космос насквозь пронизан информацией.\u003C/strong>\u003C/p>\u003Cp>\u003Cbr>Эта информация буквально проходит сквозь вас непрерывным потоком.\u003Cbr>В Космосе нет никаких тайн. И только ваши вибрации, уровень ваших вибраций отделяет вас от всех тайн Космоса.\u003C/p>\u003Cp>И каждый из вас, поднимая свои вибрации, получает доступ ко всё новым и новым уровням знания. Вы в своём сознании бесконечно взбираетесь к вечной Истине. И этот ваш путь к Божественной Истине требует от вас напряжения всех ваших сил. Только испытывая состояния постоянного напряжения и постоянного преодоления себя, вы растёте, и вы поднимаетесь всё выше и выше к вершине Божественного сознания.\u003C/p>\u003Cbr>\u003Cp>И вы переходите из одного мира в другой мир, вы путешествуете по этой Вселенной, потом вы приобретаете возможность путешествовать в другие Вселенные.\u003C/p>\u003Cp>Наверное, для многих из вас будет неожиданностью, если я скажу, что всё находится внутри вас. И миры соединяются внутри вас. И все ваши достижения накапливаются внутри вас. Вы абсолютно уникальны. И вы действительно созданы по образу и подобию Бога...\u003C/p>\u003Cbr>\u003Cp>Сейчас в вас много плотского, тяжёлого, человеческого, эгоистичного. Вы постепенно отказываетесь от этих ваших атрибутов игры в физическом мире. Со временем вам уже не нужно будет ваше физическое тело. Потом вы расстанетесь с вашими астральным, ментальным и даже эфирным телами. И подобно тому, как из куколки рождается бабочка, вы вспорхнёте и полетите в Космос. Вы обретёте новое существование в новых телах.\u003C/p>\u003Cbr>\u003Cp>Потому что ваши нынешние тела нужны вам только для того, чтобы жить в физическом мире. И когда наступит космический момент, вы расстанетесь с этими своими телами и будете жить в других телах – ваших реальных телах. И для вас уже не будет существовать ограничений пространства и времени. Потому что и пространство, и время представляют собой только декорации, на фоне которых происходит развитие вашей бессмертной части.\u003C/p>\u003Cbr>\u003Cp>И наступит момент, когда вы будете вспоминать минуты вашего пребывания в физических телах, потому что все ваши земные жизни с высоты вашего космического сознания будут казаться всего лишь несколькими минутами, проведёнными в плотном мире. Вы будете вспоминать ваш земной опыт, и вам будет непонятно, почему вы не видели своё прошлое и будущее, почему вы были так слепы и ограниченны. Однако именно в преодолении себя происходит вечное развитие и совершенствование.\u003C/p>\u003Cp>Вселенная перестанет существовать, если она утратит способность к саморазвитию и совершенствованию. И в отношении Вселенной действует точно такой же принцип, который действует по отношению к жизни тех людей, которые не хотят развиваться, которые забились, подобно тараканам, в щели своего зауженного сознания и не хотят выходить на Свет.\u003C/p>\u003Cbr>\u003Cp>Всё, что не хочет следовать главному закону этой Вселенной, закону саморазвития и совершенствования, не может существовать дольше определённой границы.\u003C/p>\u003Cp>Полюбите напряжение всех своих сил и возможностей. Полюбите устремление и бурный поток препятствий, которые вы преодолеваете.\u003C/p>\u003Cbr>\u003Cp>Благословляйте эти препятствия, благословляйте своих врагов, благословляйте все обстоятельства и трудности вашей жизни, ибо они помогают вам расти и преодолевать себя.\u003C/p>\u003Cbr>\u003Cp>Развитые индивидуумы стремятся получить рождения в как можно более тяжелых жизненных условиях. Они знают вкус преодоления себя и испытывают удовольствие от препятствий.\u003C/p>\u003Cbr>\u003Cp>Вы живёте в удивительно благословенное время. Вы имеете возможность беспрецедентного внутреннего роста.\u003C/p>\u003Cbr>\u003Cp>(Могущественный Космос через Т.Микушину)\u003C/p>\u003Cp>Полная версия https://sirius-ru.net/dictations/mart_iun_2005/2005.05.03.htm\u003C/p>","\u003Cstrong>Космос насквозь пронизан энергией, и Космос насквозь пронизан информацией.\u003C/strong>","img/1743029238018art1.webp","2025-03-26T22:47:46.034Z",{"name":41,"pseudo":42,"id":5},{"id":5,"title":6,"title_en":7},{"comments":79,"ok":36},[],1748537357490]