<template>
    <section class="content">
<h1>Добро пожаловать на сайт Вдохновение!<br>
Здесь происходит <strong>Транслирование знаний</strong>.</h1>

<div class="article">
<p>Суть данного сайта - это единение в распространении энергий Любви и знаний, которые начнут пробуждать окружающих. 
</p>
<p>Посколько мы все части единого, когда соберёмся как паззлы вместе, и начнём служить во Благо друг друга и всего мира, то картина данного пространства ОЖИВЁТ! 
</p>
<p>В этом пазле важен и ценен каждый, у каждого конкретные задачи и функции. Мы воплотились, чтоб найти друг друга, пробудиться и слиться в ЕДИНОМ БОЖЕСТВЕННОМ СОЛНЦЕ и ТВОРИТЬ ЛЮБОВЬ!
</p>
<p>Каждый имеет дары и знания в определённом направлении, начните делиться ими, помогая трансформировать сознание  окружающих. Включайтесь! Просыпайтесь! 
</p>
<p>Пишите в комментариях или в личку @MarinaVdohOm чье сердце откликается к ЕДИНЕНИЮ, кто в какой сфере силён и какими благостными знаниями может помочь оСВЕТить этот мир. ✨✨✨
</p>
</div>

        <div class="blockList">
        <h2>Все публикации:</h2>



        </div>

    </section>
</template>


<script setup lang="ts">
useSeoMeta({
  title: 'Сайт Вдохновение. Путеводитель в мире знаний.',
  ogTitle: 'Сайт Вдохновение. Путеводитель в мире знаний.',
  description: 'Вдохновение - это Видеть, слышать, чувствовать. Восхвалять творение, быть его частью ежесекундно! Это единение в распространении энергий Любви и знаний, которые начнут пробуждать окружающих.',
  ogDescription: 'Вдохновение - это Видеть, слышать, чувствовать. Восхвалять творение, быть его частью ежесекундно! Это единение в распространении энергий Любви и знаний, которые начнут пробуждать окружающих.',
  ogImage: '/img/summary_small_image.png',
  twitterCard: 'summary_large_image',
})

</script>
